# Ivan Zepeda
## C0883949
Inclass activity w8  
03-July

### MODULE 4

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv')

In [5]:
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [14]:
for c in df.columns:
    print(c,"-",df[c].dtype)

Name - object
PClass - object
Age - float64
Sex - object
Survived - int64
SexCode - int64

In [12]:
df.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
SexCode       int64
dtype: object

In [16]:
# Will only consider numeric columns
df.describe(percentiles=[.1,.5,.8])

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
10%     16.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
80%     43.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [18]:
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [ ]:
df.loc[1:4] # When I have index as numeric values, should work

In [23]:
df = df.set_index(df['Name'])

ValueError: cannot insert Name, already exists

In [24]:
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [27]:
# Selecting rows or subsection, based on conditions

df[df['Sex']=='female'].shape

(462, 6)

In [30]:
# Multiple Conditions
df[(df['Sex']=='female') | (df['Age']>=65)].shape

(469, 6)

In [31]:
df['Sex'].replace(['female','male'] , ['Woman','Man']).head()

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
Name: Sex, dtype: object

In [32]:
df['Sex'].unique() # NO assignation

array(['female', 'male'], dtype=object)

In [33]:
df['Sex'].map({'female':'Woman','male':'Man'})

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
                                                 ...
Zakarian, Mr Artun                                 Man
Zakarian, Mr Maprieder                             Man
Zenni, Mr Philip                                   Man
Lievens, Mr Rene                                   Man
Zimmerman, Leo                                     Man
Name: Sex, Length: 1313, dtype: object

In [34]:
df.rename(columns={'PClass':'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [36]:
# Finding Minimum MAximum Sum Average Count

print('Maximum', df['Age'].max())
print('Minimum', df['Age'].min())
print('Mean', df['Age'].mean())
print('Sum', df['Age'].sum())
print('Count', df['Age'].count())

Maximum 71.0
Minimum 0.17
Mean 30.397989417989415
Sum 22980.88
Count 756

In [38]:
df[df['Age'].isnull()].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Aubert, Mrs Leontine Pauline","Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
"Barkworth, Mr Algernon H","Barkworth, Mr Algernon H",1st,NaN,male,1,0

In [40]:
import numpy as np
df['Sex'].replace('male',np.nan)

Name
Allen, Miss Elisabeth Walton                     female
Allison, Miss Helen Loraine                      female
Allison, Mr Hudson Joshua Creighton                 NaN
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    female
Allison, Master Hudson Trevor                       NaN
                                                  ...
Zakarian, Mr Artun                                  NaN
Zakarian, Mr Maprieder                              NaN
Zenni, Mr Philip                                    NaN
Lievens, Mr Rene                                    NaN
Zimmerman, Leo                                      NaN
Name: Sex, Length: 1313, dtype: object

In [41]:
# Remove a column 
#del df['Name']
df.drop('Age', axis=1).head(2)

,Name,PClass,Sex,Survived,SexCode
Name,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,female,0,1

In [44]:
df[df['Sex'] != 'male'].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [45]:
print(df['Sex'].unique())
# Value counts
df['Sex'].value_counts()

['female' 'male']

male      851
female    462
Name: Sex, dtype: int64

In [49]:
# Number of unique values
df['Sex'].nunique()

2

In [48]:
df['Sex'].unique().sum()

'femalemale'

In [53]:
# count all nan values
df['Sex'].isna().value_counts()

False    1313
Name: Sex, dtype: int64

In [54]:
df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [55]:
# Looping over a column
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [56]:
# Difference is that this one returns a list, previous one return strings
[name.upper() for name in df['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [58]:
# Applying a function on a column

def uppercase(x):
    return x.upper()
df['Name_upper'] = df['Name'].apply(uppercase)

In [60]:
df[['Sex_upper','PClass_upper']] = df[['Sex','PClass']].apply(uppercase)
df

AttributeError: 'Series' object has no attribute 'upper'

In [61]:
# Apply a funciton on a group
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode  Name_upper
Sex
female   462     462  288  462       462      462         462
male     851     851  468  851       851      851         851

# Send row value to multiple parameters.
>def process_columns(par_a,par_b, par_c):  
    # Process Alll with par_a, par_b, par_c  
    return new_par_a, new_par_b, new_par_c

mock_df[['new_par_A','new_par_B','new_par_C']] = mock_df.apply(lambda x : process_columns(mock_df['col_a'], mock_df['col_b'], mock_df['col_c']))

In [62]:
# COncatenate
# axis=0 concatenate along therow axis, axis=1 => column
# axis 0 means rows, and rows will add above rows
data_a =  {'id': ['1','2','3'], 
          'first':['Alex','Amy','Allen'],
          'last':['Anderson','Ackerman','Ali']}
df_a= pd.DataFrame(data_a, columns=['id','first','last'])

In [63]:

data_b=  {'id': ['4','5','6'], 
          'first':['Billy','Brian','Bran'],
          'last':['Bonder','Black','Balwner']}
df_b = pd.DataFrame(data_b, columns=['id','first','last'])

In [64]:
pd.concat([df_a,df_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [70]:
# MERGING
employee_data= {'employee_id':['1','2','3','4'],
               'name':['Amy Jones','Allen Keys','Alice Bees','Tim horton'],
               }
df_employees = pd.DataFrame(employee_data, columns =['employee_id','name'])

In [71]:
sales_data = {'employee_id':['3','4','5','6'],
              'total_sales': [2345,5254,56765,2346]
             }
df_sales = pd.DataFrame(sales_data, columns = ['employee_id','total_sales'])

In [67]:
# we use on parameter to specify the shared column if that column has a same name in both dataframes. 
# If the shared column has two different names, we use, left_on, right_on, parameters
# the default value for how is INNER

pd.merge(df_employees, df_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees         2345
1           4  Tim horton         5254

In [72]:
# to merge including all employees, although not with sales is use:
pd.merge(df_employees, df_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees       2345.0
3           4  Tim horton       5254.0
4           5         NaN      56765.0
5           6         NaN       2346.0

In [75]:
# Just to mess around, change the name of the column from employee_id to id. rename use columns=mapping
df.rename(columns={'employee_id':'id'})
pd.merge(df_employees, df_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees       2345.0
3           4  Tim horton       5254.0
4           5         NaN      56765.0
5           6         NaN       2346.0

In [76]:
pd.merge(df_employees, df_sales, left_on = 'employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees         2345
1           4  Tim horton         5254

#  
#  
# MODULE 5
Categorical vs numerical columns   
do some data transformation in columns,   
talk about outliers, discretizing the features,

### Normalization

In [77]:
import numpy as np
from sklearn import preprocessing
feature = np.array([[-500],[-111],[0],[100],[900]])
minmax_scale = preprocessing.MinMaxScaler(feature_range=(0,1))
scaled_feature = minmax_scale.fit_transform(feature)

In [78]:
scaled_feature

array([[0.        ],
       [0.27785714],
       [0.35714286],
       [0.42857143],
       [1.        ]])

### Standarization

In [81]:
scaler = preprocessing.StandardScaler()
standardized = scaler.fit_transform(feature)
standardized

array([[-1.25962986],
       [-0.41159245],
       [-0.16960748],
       [ 0.04839699],
       [ 1.79243279]])

The differences is that Normalization is a number between 0 and 1, 
while Standarization is a number close to 0, romaing around the std